export const palacesQuestions = [
  'Почему наши предки строили замки?',
  'По поручению кого и когда был построен Лидский замок?',
  'В каком стиле выполнен Лидский замок?',
  'Какой замок считается братом-близнецом Лидского замка?',
  'Какие легенды о Мирском  замке вы знаете?',
  'Какое легендарное событие Лидского замка легло в основу многих театрализованных представлений?',
  'Какой архитектурный стиль Мирского замка?',
  'Какой замок расположен в д. Гайтюнишки Вороновского района?',
  'Кем и в каком году был построен замок  в  д. Гайтюнишки ,Вороновского района?',
  'Для чего используется дом-крепость в настоящее время(что размещается в настоящее время в доме-крепости)?',
];

export const palacesQuizData = [
  {
    id: '0',
    question: 'Почему наши предки строили замки?',
    answers: [
      'Так теплее',
      'Для защиты от нападения',
      'Нечем было заняться',
      'Некуда было девать кирпичи',
    ],
    correctAnswer: 'Для защиты от нападения',
  },
  {
    id: '1',
    question: 'По поручению кого и когда был построен Лидский замок?',
    answers: ['В 1323г., Гедемином', 'В 1400г., Ягайло', 'В 1350г., Радзивилом'],
    correctAnswer: 'В 1323г., Гедемином',
  },
  {
    id: '2',
    question: 'В каком стиле выполнен Лидский замок?',
    answers: ['Ренессанс', 'Романско-готическом', 'Дворцовый'],
    correctAnswer: 'Романско-готическом',
  },
  {
    id: '3',
    question: 'Какой замок считается братом-близнецом Лидского замка?',
    answers: ['Кревский', 'Мирский', 'Несвижский'],
    correctAnswer: 'Кревский',
  },
];

export const gravesQuizData = [
  {
    id: '0',
    question: '',
    answers: [
      'За образцовое выполнение боевых заданий в борьбе с немецкими захватчиками',
      'За достижения в сельском хозяйстве',
      'За высокие достижения в науке',
    ],
    correctAnswer: 'За образцовое выполнение боевых заданий в борьбе с немецкими захватчиками',
  },
  {
    id: '1',
    question: '',
    answers: ['Стрельников', 'Семашко', 'Литовчик', 'Киров'],
    correctAnswer: 'Литовчик',
  },
  {
    id: '2',
    question: '',
    answers: [
      'Памятник на месте расстрела евреев',
      'Братская могила',
      'Памятник войнам интернационалистам',
    ],
    correctAnswer: 'Памятник на месте расстрела евреев',
  },
  {
    id: '3',
    question: '',
    answers: [
      'В боях на освобождение Вороново',
      'В Вороновский лесах от рук бандитов',
      'При переправе через реку Березинку',
      'При форсировании реки Проня',
    ],
    correctAnswer: 'В Вороновский лесах от рук бандитов',
  },
  {
    id: '4',
    question: '',
    answers: [
      'Братская могила',
      'Памятник юным героям-антифашистам',
      'Обелиск на месте гибели 1834 местных жителей',
    ],
    correctAnswer: 'Обелиск на месте гибели 1834 местных жителей',
  },
];
